In [16]:
# Dependencies
import os
import csv
import pandas as pd

In [21]:
# Create a Pandas Series from the following list of schools.
bootcamp_univ = ["UCLA", "UC Berkeley", "UC Irvine","University of Central Florida", "Rutgers University"]

# Option 1. 
data_series = pd.Series(["UCLA", "UC Berkeley", "UC Irvine",
                         "University of Central Florida", "Rutgers University"])
print(data_series)

#  Option 2. 
data_series_2 = pd.Series(bootcamp_univ)

print(data_series_2)

0                             UCLA
1                      UC Berkeley
2                        UC Irvine
3    University of Central Florida
4               Rutgers University
dtype: object
0                             UCLA
1                      UC Berkeley
2                        UC Irvine
3    University of Central Florida
4               Rutgers University
dtype: object

In [31]:
# Convert the following list of dictionaries into a DataFrame.
movies_dicts = [{"Title": "The Godfather", "Year Released": 1972},
                {"Title": "The Shawshank Redemption", "Year Released": 1994},
                {"Title": "Pulp Fiction", "Year Released": 1994},
                {"Title": "The Lord of the Rings: The Return of the King", "Year Released": 2003}]
movie_df= pd.DataFrame(movies_dicts)
movie_df

                                           Title  Year Released
0                                  The Godfather           1972
1                       The Shawshank Redemption           1994
2                                   Pulp Fiction           1994
3  The Lord of the Rings: The Return of the King           2003

In [32]:
# Edit the movie_dicts so that the the values for the "Title" and "Year Released" are list of movie titles and years.
#  Then, convert the dictionary of lists into a DataFrame.

movies_dicts = {"Title": ["The Godfather", "The Shawshank Redemption","Pulp Fiction",
                           "The Lord of the Rings: The Return of the King"], 
                "Year Released": [1972, 1994, 1994, 2003]}

movie_df = pd.DataFrame(movies_dicts)
movie_df

                                           Title  Year Released
0                                  The Godfather           1972
1                       The Shawshank Redemption           1994
2                                   Pulp Fiction           1994
3  The Lord of the Rings: The Return of the King           2003

In [37]:
# Create a DataFrame using a dictionary of lists

smartphones_df = pd.DataFrame({
            "Smartphones": ["iphone", "samsung", "lg", "huawei", "zte"],
            "Price": [1500.00, 1300.00, 1100.00,850.00,730.00 ],
            "Sales": [10, 5, 20, 15, "N/A"]
})
smartphones_df

  Smartphones   Price Sales
0      iphone  1500.0    10
1     samsung  1300.0     5
2          lg  1100.0    20
3      huawei   850.0    15
4         zte   730.0   N/A